add diagrams
